app/views/cinefile/show.html.erb


<% @user.cinefile.films.each do |film| %>
---
SELECT  "cinefiles".* FROM "cinefiles" WHERE "cinefiles"."user_id" = $1 LIMIT 1  [["user_id", 94]]
SELECT "list_films".* FROM "list_films" WHERE "list_films"."cinefile_id" = $1  [["cinefile_id", 13]]