app/views/users/show.html.erb

SELECT  1 AS one FROM "cinefiles" WHERE "cinefiles"."user_id" = $1 LIMIT 1  [["user_id", 57]]
---
<%= button_to "Create Cinefile", new_user_cinefile_path(@user), method: :get %>
<% if @user.cinefiles.any? %>