app/controllers/cinefiles_controller.rb

  def create
    @user = current_user
    @user.cinefiles.create if !@user.cinefiles.any?
---
INSERT INTO "cinefiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 79], ["created_at", "2016-09-07 13:09:15.733195"], ["updated_at", "2016-09-07 13:09:15.733195"]]
SELECT  "cinefiles".* FROM "cinefiles" WHERE "cinefiles"."user_id" = $1  ORDER BY "cinefiles"."id" ASC LIMIT 1  [["user_id", 153]]
SELECT  1 AS one FROM "cinefiles" WHERE "cinefiles"."user_id" = $1 LIMIT 1  [["user_id", 148]]