app/controllers/cinefile_controller.rb

  def create
    @user = current_user
      if @user.cinefile.nil?
       @cinefile = Cinefile.create
---
INSERT INTO "cinefiles" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-09-07 15:19:42.717909"], ["updated_at", "2016-09-07 15:19:42.717909"]]

  def show
    @cinemas = Cinema.all
    @screenings = Screening.all
    @films = Film.all
    @user = current_user
    @cinefile = @user.cinefile
    @list_films = @cinefile.list_films.all
---
SELECT "list_films".* FROM "list_films" WHERE "list_films"."cinefile_id" = $1  [["cinefile_id", 13]]
SELECT  "cinefiles".* FROM "cinefiles" WHERE "cinefiles"."user_id" = $1 LIMIT 1  [["user_id", 94]]
SELECT  "film_lists".* FROM "film_lists" WHERE "film_lists"."cinefile_id" = $1 LIMIT 1  [["cinefile_id", 7]]