app/controllers/films_controller.rb

  def create
    console
    @user = current_user
    @cinefile = @user.cinefile
    cinefile_id = @cinefile.id
    @film_info = params["film_record"].split(",")
    @film_release_year = @film_info.delete(@film_info[-3])
    @tmdb_id = @film_info.delete(@film_info[-2])
    @poster_path = @film_info.delete(@film_info[-1])
    @title = @film_info.join(',')
    film_not_in_database = Film.find_by(tmdb_id: @tmdb_id).nil?
    if film_not_in_database
      Film.create(title: @title, tmdb_id: @tmdb_id, release_year: @film_release_year, poster_path: @poster_path)
---
INSERT INTO "films" ("title", "cinefile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Jay and silent Bob"], ["cinefile_id", 1], ["created_at", "2016-09-07 16:56:13.613249"], ["updated_at", "2016-09-07 16:56:13.613249"]]

  def destroy
    console
    @list_film = ListFilm.find_by(tmdb_id: @tmdb_id)
    @list_film.destroy
---
DELETE FROM "films" WHERE "films"."id" = $1  [["id", 2]]