app/controllers/list_films_controller.rb

SELECT "films".* FROM "films"
INSERT INTO "list_films" ("film_id", "cinefile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["film_id", 15], ["cinefile_id", 28], ["created_at", "2016-09-08 17:54:34.497955"], ["updated_at", "2016-09-08 17:54:34.497955"]]
---
  def create
    @films = Film.all
    @films.each do |film|
      if film.title == list_film_params["title"]
        @ref = film.id
      end
    end
    @user = current_user
    @cinefile = @user.cinefile
    @cinefile.list_films.create(film_id: @ref)